SiliconLabs/gecko_sdk/platform/Device/SiliconLabs/EFR32BG24/Include/efr32bg24_rac.h
/* Bit fields for RAC PATRIM1 */
#define _RAC_PATRIM1_RESETVALUE                                       0x03034373UL                                                     /**< Default value for RAC_PATRIM1               */
#define _RAC_PATRIM1_MASK                                             0x0777F3F7UL                                                     /**< Mask for RAC_PATRIM1                        */
#define _RAC_PATRIM1_TX0DBMTRIMPREDRVREGIBCORE_SHIFT                  0                                                                /**< Shift value for RAC_TX0DBMTRIMPREDRVREGIBCORE*/
#define _RAC_PATRIM1_TX0DBMTRIMPREDRVREGIBCORE_MASK                   0x3UL                                                            /**< Bit mask for RAC_TX0DBMTRIMPREDRVREGIBCORE  */
#define _RAC_PATRIM1_TX0DBMTRIMPREDRVREGIBCORE_DEFAULT                0x00000003UL                                                     /**< Mode DEFAULT for RAC_PATRIM1                */
#define _RAC_PATRIM1_TX0DBMTRIMPREDRVREGIBCORE_i_4u                   0x00000000UL                                                     /**< Mode i_4u for RAC_PATRIM1                   */
#define _RAC_PATRIM1_TX0DBMTRIMPREDRVREGIBCORE_i_5u                   0x00000001UL                                                     /**< Mode i_5u for RAC_PATRIM1                   */
#define _RAC_PATRIM1_TX0DBMTRIMPREDRVREGIBCORE_i_6u                   0x00000002UL                                                     /**< Mode i_6u for RAC_PATRIM1                   */
#define _RAC_PATRIM1_TX0DBMTRIMPREDRVREGIBCORE_i_default_7u           0x00000003UL                                                     /**< Mode i_default_7u for RAC_PATRIM1           */
#define RAC_PATRIM1_TX0DBMTRIMPREDRVREGIBCORE_DEFAULT                 (_RAC_PATRIM1_TX0DBMTRIMPREDRVREGIBCORE_DEFAULT << 0)            /**< Shifted mode DEFAULT for RAC_PATRIM1        */
#define RAC_PATRIM1_TX0DBMTRIMPREDRVREGIBCORE_i_4u                    (_RAC_PATRIM1_TX0DBMTRIMPREDRVREGIBCORE_i_4u << 0)               /**< Shifted mode i_4u for RAC_PATRIM1           */
#define RAC_PATRIM1_TX0DBMTRIMPREDRVREGIBCORE_i_5u                    (_RAC_PATRIM1_TX0DBMTRIMPREDRVREGIBCORE_i_5u << 0)               /**< Shifted mode i_5u for RAC_PATRIM1           */
#define RAC_PATRIM1_TX0DBMTRIMPREDRVREGIBCORE_i_6u                    (_RAC_PATRIM1_TX0DBMTRIMPREDRVREGIBCORE_i_6u << 0)               /**< Shifted mode i_6u for RAC_PATRIM1           */
#define RAC_PATRIM1_TX0DBMTRIMPREDRVREGIBCORE_i_default_7u            (_RAC_PATRIM1_TX0DBMTRIMPREDRVREGIBCORE_i_default_7u << 0)       /**< Shifted mode i_default_7u for RAC_PATRIM1   */
#define RAC_PATRIM1_TX0DBMTRIMPREDRVREGPSR                            (0x1UL << 2)                                                     /**< TX0DBMTRIMPREDRVREGPSR                      */
#define _RAC_PATRIM1_TX0DBMTRIMPREDRVREGPSR_SHIFT                     2                                                                /**< Shift value for RAC_TX0DBMTRIMPREDRVREGPSR  */
#define _RAC_PATRIM1_TX0DBMTRIMPREDRVREGPSR_MASK                      0x4UL                                                            /**< Bit mask for RAC_TX0DBMTRIMPREDRVREGPSR     */
#define _RAC_PATRIM1_TX0DBMTRIMPREDRVREGPSR_DEFAULT                   0x00000000UL                                                     /**< Mode DEFAULT for RAC_PATRIM1                */
#define _RAC_PATRIM1_TX0DBMTRIMPREDRVREGPSR_disable                   0x00000000UL                                                     /**< Mode disable for RAC_PATRIM1                */
#define _RAC_PATRIM1_TX0DBMTRIMPREDRVREGPSR_enable                    0x00000001UL                                                     /**< Mode enable for RAC_PATRIM1                 */
#define RAC_PATRIM1_TX0DBMTRIMPREDRVREGPSR_DEFAULT                    (_RAC_PATRIM1_TX0DBMTRIMPREDRVREGPSR_DEFAULT << 2)               /**< Shifted mode DEFAULT for RAC_PATRIM1        */
#define RAC_PATRIM1_TX0DBMTRIMPREDRVREGPSR_disable                    (_RAC_PATRIM1_TX0DBMTRIMPREDRVREGPSR_disable << 2)               /**< Shifted mode disable for RAC_PATRIM1        */
#define RAC_PATRIM1_TX0DBMTRIMPREDRVREGPSR_enable                     (_RAC_PATRIM1_TX0DBMTRIMPREDRVREGPSR_enable << 2)                /**< Shifted mode enable for RAC_PATRIM1         */
#define _RAC_PATRIM1_TX0DBMTRIMPREDRVREGIBNDIO_SHIFT                  4                                                                /**< Shift value for RAC_TX0DBMTRIMPREDRVREGIBNDIO*/
#define _RAC_PATRIM1_TX0DBMTRIMPREDRVREGIBNDIO_MASK                   0xF0UL                                                           /**< Bit mask for RAC_TX0DBMTRIMPREDRVREGIBNDIO  */
#define _RAC_PATRIM1_TX0DBMTRIMPREDRVREGIBNDIO_DEFAULT                0x00000007UL                                                     /**< Mode DEFAULT for RAC_PATRIM1                */
#define _RAC_PATRIM1_TX0DBMTRIMPREDRVREGIBNDIO_vreg_1p127             0x00000000UL                                                     /**< Mode vreg_1p127 for RAC_PATRIM1             */
#define _RAC_PATRIM1_TX0DBMTRIMPREDRVREGIBNDIO_vreg_1p171             0x00000001UL                                                     /**< Mode vreg_1p171 for RAC_PATRIM1             */
#define _RAC_PATRIM1_TX0DBMTRIMPREDRVREGIBNDIO_vreg_1p209             0x00000002UL                                                     /**< Mode vreg_1p209 for RAC_PATRIM1             */
#define _RAC_PATRIM1_TX0DBMTRIMPREDRVREGIBNDIO_vreg_1p244             0x00000003UL                                                     /**< Mode vreg_1p244 for RAC_PATRIM1             */
#define _RAC_PATRIM1_TX0DBMTRIMPREDRVREGIBNDIO_vreg_1p275             0x00000004UL                                                     /**< Mode vreg_1p275 for RAC_PATRIM1             */
#define _RAC_PATRIM1_TX0DBMTRIMPREDRVREGIBNDIO_vreg_1p305             0x00000005UL                                                     /**< Mode vreg_1p305 for RAC_PATRIM1             */
#define _RAC_PATRIM1_TX0DBMTRIMPREDRVREGIBNDIO_vreg_1p335             0x00000006UL                                                     /**< Mode vreg_1p335 for RAC_PATRIM1             */
#define _RAC_PATRIM1_TX0DBMTRIMPREDRVREGIBNDIO_vreg_default_1p362     0x00000007UL                                                     /**< Mode vreg_default_1p362 for RAC_PATRIM1     */
#define _RAC_PATRIM1_TX0DBMTRIMPREDRVREGIBNDIO_vreg_1p388             0x00000008UL                                                     /**< Mode vreg_1p388 for RAC_PATRIM1             */
#define _RAC_PATRIM1_TX0DBMTRIMPREDRVREGIBNDIO_vreg_1p414             0x00000009UL                                                     /**< Mode vreg_1p414 for RAC_PATRIM1             */
#define _RAC_PATRIM1_TX0DBMTRIMPREDRVREGIBNDIO_vreg_1p439             0x0000000AUL                                                     /**< Mode vreg_1p439 for RAC_PATRIM1             */
#define _RAC_PATRIM1_TX0DBMTRIMPREDRVREGIBNDIO_vreg_1p463             0x0000000BUL                                                     /**< Mode vreg_1p463 for RAC_PATRIM1             */
#define _RAC_PATRIM1_TX0DBMTRIMPREDRVREGIBNDIO_vreg_1p486             0x0000000CUL                                                     /**< Mode vreg_1p486 for RAC_PATRIM1             */
#define _RAC_PATRIM1_TX0DBMTRIMPREDRVREGIBNDIO_vreg_1p509             0x0000000DUL                                                     /**< Mode vreg_1p509 for RAC_PATRIM1             */
#define _RAC_PATRIM1_TX0DBMTRIMPREDRVREGIBNDIO_vreg_1p532             0x0000000EUL                                                     /**< Mode vreg_1p532 for RAC_PATRIM1             */
#define _RAC_PATRIM1_TX0DBMTRIMPREDRVREGIBNDIO_vreg_1p555             0x0000000FUL                                                     /**< Mode vreg_1p555 for RAC_PATRIM1             */
#define RAC_PATRIM1_TX0DBMTRIMPREDRVREGIBNDIO_DEFAULT                 (_RAC_PATRIM1_TX0DBMTRIMPREDRVREGIBNDIO_DEFAULT << 4)            /**< Shifted mode DEFAULT for RAC_PATRIM1        */
#define RAC_PATRIM1_TX0DBMTRIMPREDRVREGIBNDIO_vreg_1p127              (_RAC_PATRIM1_TX0DBMTRIMPREDRVREGIBNDIO_vreg_1p127 << 4)         /**< Shifted mode vreg_1p127 for RAC_PATRIM1     */
#define RAC_PATRIM1_TX0DBMTRIMPREDRVREGIBNDIO_vreg_1p171              (_RAC_PATRIM1_TX0DBMTRIMPREDRVREGIBNDIO_vreg_1p171 << 4)         /**< Shifted mode vreg_1p171 for RAC_PATRIM1     */
#define RAC_PATRIM1_TX0DBMTRIMPREDRVREGIBNDIO_vreg_1p209              (_RAC_PATRIM1_TX0DBMTRIMPREDRVREGIBNDIO_vreg_1p209 << 4)         /**< Shifted mode vreg_1p209 for RAC_PATRIM1     */
#define RAC_PATRIM1_TX0DBMTRIMPREDRVREGIBNDIO_vreg_1p244              (_RAC_PATRIM1_TX0DBMTRIMPREDRVREGIBNDIO_vreg_1p244 << 4)         /**< Shifted mode vreg_1p244 for RAC_PATRIM1     */
#define RAC_PATRIM1_TX0DBMTRIMPREDRVREGIBNDIO_vreg_1p275              (_RAC_PATRIM1_TX0DBMTRIMPREDRVREGIBNDIO_vreg_1p275 << 4)         /**< Shifted mode vreg_1p275 for RAC_PATRIM1     */
#define RAC_PATRIM1_TX0DBMTRIMPREDRVREGIBNDIO_vreg_1p305              (_RAC_PATRIM1_TX0DBMTRIMPREDRVREGIBNDIO_vreg_1p305 << 4)         /**< Shifted mode vreg_1p305 for RAC_PATRIM1     */
#define RAC_PATRIM1_TX0DBMTRIMPREDRVREGIBNDIO_vreg_1p335              (_RAC_PATRIM1_TX0DBMTRIMPREDRVREGIBNDIO_vreg_1p335 << 4)         /**< Shifted mode vreg_1p335 for RAC_PATRIM1     */
#define RAC_PATRIM1_TX0DBMTRIMPREDRVREGIBNDIO_vreg_default_1p362      (_RAC_PATRIM1_TX0DBMTRIMPREDRVREGIBNDIO_vreg_default_1p362 << 4) /**< Shifted mode vreg_default_1p362 for RAC_PATRIM1*/
#define RAC_PATRIM1_TX0DBMTRIMPREDRVREGIBNDIO_vreg_1p388              (_RAC_PATRIM1_TX0DBMTRIMPREDRVREGIBNDIO_vreg_1p388 << 4)         /**< Shifted mode vreg_1p388 for RAC_PATRIM1     */
#define RAC_PATRIM1_TX0DBMTRIMPREDRVREGIBNDIO_vreg_1p414              (_RAC_PATRIM1_TX0DBMTRIMPREDRVREGIBNDIO_vreg_1p414 << 4)         /**< Shifted mode vreg_1p414 for RAC_PATRIM1     */
#define RAC_PATRIM1_TX0DBMTRIMPREDRVREGIBNDIO_vreg_1p439              (_RAC_PATRIM1_TX0DBMTRIMPREDRVREGIBNDIO_vreg_1p439 << 4)         /**< Shifted mode vreg_1p439 for RAC_PATRIM1     */
#define RAC_PATRIM1_TX0DBMTRIMPREDRVREGIBNDIO_vreg_1p463              (_RAC_PATRIM1_TX0DBMTRIMPREDRVREGIBNDIO_vreg_1p463 << 4)         /**< Shifted mode vreg_1p463 for RAC_PATRIM1     */
#define RAC_PATRIM1_TX0DBMTRIMPREDRVREGIBNDIO_vreg_1p486              (_RAC_PATRIM1_TX0DBMTRIMPREDRVREGIBNDIO_vreg_1p486 << 4)         /**< Shifted mode vreg_1p486 for RAC_PATRIM1     */
#define RAC_PATRIM1_TX0DBMTRIMPREDRVREGIBNDIO_vreg_1p509              (_RAC_PATRIM1_TX0DBMTRIMPREDRVREGIBNDIO_vreg_1p509 << 4)         /**< Shifted mode vreg_1p509 for RAC_PATRIM1     */
#define RAC_PATRIM1_TX0DBMTRIMPREDRVREGIBNDIO_vreg_1p532              (_RAC_PATRIM1_TX0DBMTRIMPREDRVREGIBNDIO_vreg_1p532 << 4)         /**< Shifted mode vreg_1p532 for RAC_PATRIM1     */
#define RAC_PATRIM1_TX0DBMTRIMPREDRVREGIBNDIO_vreg_1p555              (_RAC_PATRIM1_TX0DBMTRIMPREDRVREGIBNDIO_vreg_1p555 << 4)         /**< Shifted mode vreg_1p555 for RAC_PATRIM1     */
#define _RAC_PATRIM1_TX0DBMTRIMPREDRVSLOPE_SHIFT                      8                                                                /**< Shift value for RAC_TX0DBMTRIMPREDRVSLOPE   */
#define _RAC_PATRIM1_TX0DBMTRIMPREDRVSLOPE_MASK                       0x300UL                                                          /**< Bit mask for RAC_TX0DBMTRIMPREDRVSLOPE      */
#define _RAC_PATRIM1_TX0DBMTRIMPREDRVSLOPE_DEFAULT                    0x00000003UL                                                     /**< Mode DEFAULT for RAC_PATRIM1                */
#define _RAC_PATRIM1_TX0DBMTRIMPREDRVSLOPE_slope_0                    0x00000000UL                                                     /**< Mode slope_0 for RAC_PATRIM1                */
#define _RAC_PATRIM1_TX0DBMTRIMPREDRVSLOPE_slope_1                    0x00000001UL                                                     /**< Mode slope_1 for RAC_PATRIM1                */
#define _RAC_PATRIM1_TX0DBMTRIMPREDRVSLOPE_slope_2                    0x00000002UL                                                     /**< Mode slope_2 for RAC_PATRIM1                */
#define _RAC_PATRIM1_TX0DBMTRIMPREDRVSLOPE_slope_default_max          0x00000003UL                                                     /**< Mode slope_default_max for RAC_PATRIM1      */
#define RAC_PATRIM1_TX0DBMTRIMPREDRVSLOPE_DEFAULT                     (_RAC_PATRIM1_TX0DBMTRIMPREDRVSLOPE_DEFAULT << 8)                /**< Shifted mode DEFAULT for RAC_PATRIM1        */
#define RAC_PATRIM1_TX0DBMTRIMPREDRVSLOPE_slope_0                     (_RAC_PATRIM1_TX0DBMTRIMPREDRVSLOPE_slope_0 << 8)                /**< Shifted mode slope_0 for RAC_PATRIM1        */
#define RAC_PATRIM1_TX0DBMTRIMPREDRVSLOPE_slope_1                     (_RAC_PATRIM1_TX0DBMTRIMPREDRVSLOPE_slope_1 << 8)                /**< Shifted mode slope_1 for RAC_PATRIM1        */
#define RAC_PATRIM1_TX0DBMTRIMPREDRVSLOPE_slope_2                     (_RAC_PATRIM1_TX0DBMTRIMPREDRVSLOPE_slope_2 << 8)                /**< Shifted mode slope_2 for RAC_PATRIM1        */
#define RAC_PATRIM1_TX0DBMTRIMPREDRVSLOPE_slope_default_max           (_RAC_PATRIM1_TX0DBMTRIMPREDRVSLOPE_slope_default_max << 8)      /**< Shifted mode slope_default_max for RAC_PATRIM1*/
#define _RAC_PATRIM1_TX0DBMTRIMREGFB_SHIFT                            12                                                               /**< Shift value for RAC_TX0DBMTRIMREGFB         */
#define _RAC_PATRIM1_TX0DBMTRIMREGFB_MASK                             0xF000UL                                                         /**< Bit mask for RAC_TX0DBMTRIMREGFB            */
#define _RAC_PATRIM1_TX0DBMTRIMREGFB_DEFAULT                          0x00000004UL                                                     /**< Mode DEFAULT for RAC_PATRIM1                */
#define _RAC_PATRIM1_TX0DBMTRIMREGFB_v_1p976                          0x00000000UL                                                     /**< Mode v_1p976 for RAC_PATRIM1                */
#define _RAC_PATRIM1_TX0DBMTRIMREGFB_v_1p878                          0x00000001UL                                                     /**< Mode v_1p878 for RAC_PATRIM1                */
#define _RAC_PATRIM1_TX0DBMTRIMREGFB_v_1p788                          0x00000002UL                                                     /**< Mode v_1p788 for RAC_PATRIM1                */
#define _RAC_PATRIM1_TX0DBMTRIMREGFB_v_1p707                          0x00000003UL                                                     /**< Mode v_1p707 for RAC_PATRIM1                */
#define _RAC_PATRIM1_TX0DBMTRIMREGFB_v_default_1p633                  0x00000004UL                                                     /**< Mode v_default_1p633 for RAC_PATRIM1        */
#define _RAC_PATRIM1_TX0DBMTRIMREGFB_v_1p565                          0x00000005UL                                                     /**< Mode v_1p565 for RAC_PATRIM1                */
#define _RAC_PATRIM1_TX0DBMTRIMREGFB_v_1p503                          0x00000006UL                                                     /**< Mode v_1p503 for RAC_PATRIM1                */
#define _RAC_PATRIM1_TX0DBMTRIMREGFB_v_1p445                          0x00000007UL                                                     /**< Mode v_1p445 for RAC_PATRIM1                */
#define _RAC_PATRIM1_TX0DBMTRIMREGFB_v_1p392                          0x00000008UL                                                     /**< Mode v_1p392 for RAC_PATRIM1                */
#define _RAC_PATRIM1_TX0DBMTRIMREGFB_v_1p342                          0x00000009UL                                                     /**< Mode v_1p342 for RAC_PATRIM1                */
#define _RAC_PATRIM1_TX0DBMTRIMREGFB_v_1p296                          0x0000000AUL                                                     /**< Mode v_1p296 for RAC_PATRIM1                */
#define _RAC_PATRIM1_TX0DBMTRIMREGFB_v_1p253                          0x0000000BUL                                                     /**< Mode v_1p253 for RAC_PATRIM1                */
#define _RAC_PATRIM1_TX0DBMTRIMREGFB_v_1p213                          0x0000000CUL                                                     /**< Mode v_1p213 for RAC_PATRIM1                */
#define _RAC_PATRIM1_TX0DBMTRIMREGFB_v_1p175                          0x0000000DUL                                                     /**< Mode v_1p175 for RAC_PATRIM1                */
#define _RAC_PATRIM1_TX0DBMTRIMREGFB_v_1p14                           0x0000000EUL                                                     /**< Mode v_1p14 for RAC_PATRIM1                 */
#define _RAC_PATRIM1_TX0DBMTRIMREGFB_v_1p106                          0x0000000FUL                                                     /**< Mode v_1p106 for RAC_PATRIM1                */
#define RAC_PATRIM1_TX0DBMTRIMREGFB_DEFAULT                           (_RAC_PATRIM1_TX0DBMTRIMREGFB_DEFAULT << 12)                     /**< Shifted mode DEFAULT for RAC_PATRIM1        */
#define RAC_PATRIM1_TX0DBMTRIMREGFB_v_1p976                           (_RAC_PATRIM1_TX0DBMTRIMREGFB_v_1p976 << 12)                     /**< Shifted mode v_1p976 for RAC_PATRIM1        */
#define RAC_PATRIM1_TX0DBMTRIMREGFB_v_1p878                           (_RAC_PATRIM1_TX0DBMTRIMREGFB_v_1p878 << 12)                     /**< Shifted mode v_1p878 for RAC_PATRIM1        */
#define RAC_PATRIM1_TX0DBMTRIMREGFB_v_1p788                           (_RAC_PATRIM1_TX0DBMTRIMREGFB_v_1p788 << 12)                     /**< Shifted mode v_1p788 for RAC_PATRIM1        */
#define RAC_PATRIM1_TX0DBMTRIMREGFB_v_1p707                           (_RAC_PATRIM1_TX0DBMTRIMREGFB_v_1p707 << 12)                     /**< Shifted mode v_1p707 for RAC_PATRIM1        */
#define RAC_PATRIM1_TX0DBMTRIMREGFB_v_default_1p633                   (_RAC_PATRIM1_TX0DBMTRIMREGFB_v_default_1p633 << 12)             /**< Shifted mode v_default_1p633 for RAC_PATRIM1*/
#define RAC_PATRIM1_TX0DBMTRIMREGFB_v_1p565                           (_RAC_PATRIM1_TX0DBMTRIMREGFB_v_1p565 << 12)                     /**< Shifted mode v_1p565 for RAC_PATRIM1        */
#define RAC_PATRIM1_TX0DBMTRIMREGFB_v_1p503                           (_RAC_PATRIM1_TX0DBMTRIMREGFB_v_1p503 << 12)                     /**< Shifted mode v_1p503 for RAC_PATRIM1        */
#define RAC_PATRIM1_TX0DBMTRIMREGFB_v_1p445                           (_RAC_PATRIM1_TX0DBMTRIMREGFB_v_1p445 << 12)                     /**< Shifted mode v_1p445 for RAC_PATRIM1        */
#define RAC_PATRIM1_TX0DBMTRIMREGFB_v_1p392                           (_RAC_PATRIM1_TX0DBMTRIMREGFB_v_1p392 << 12)                     /**< Shifted mode v_1p392 for RAC_PATRIM1        */
#define RAC_PATRIM1_TX0DBMTRIMREGFB_v_1p342                           (_RAC_PATRIM1_TX0DBMTRIMREGFB_v_1p342 << 12)                     /**< Shifted mode v_1p342 for RAC_PATRIM1        */
#define RAC_PATRIM1_TX0DBMTRIMREGFB_v_1p296                           (_RAC_PATRIM1_TX0DBMTRIMREGFB_v_1p296 << 12)                     /**< Shifted mode v_1p296 for RAC_PATRIM1        */
#define RAC_PATRIM1_TX0DBMTRIMREGFB_v_1p253                           (_RAC_PATRIM1_TX0DBMTRIMREGFB_v_1p253 << 12)                     /**< Shifted mode v_1p253 for RAC_PATRIM1        */
#define RAC_PATRIM1_TX0DBMTRIMREGFB_v_1p213                           (_RAC_PATRIM1_TX0DBMTRIMREGFB_v_1p213 << 12)                     /**< Shifted mode v_1p213 for RAC_PATRIM1        */
#define RAC_PATRIM1_TX0DBMTRIMREGFB_v_1p175                           (_RAC_PATRIM1_TX0DBMTRIMREGFB_v_1p175 << 12)                     /**< Shifted mode v_1p175 for RAC_PATRIM1        */
#define RAC_PATRIM1_TX0DBMTRIMREGFB_v_1p14                            (_RAC_PATRIM1_TX0DBMTRIMREGFB_v_1p14 << 12)                      /**< Shifted mode v_1p14 for RAC_PATRIM1         */
#define RAC_PATRIM1_TX0DBMTRIMREGFB_v_1p106                           (_RAC_PATRIM1_TX0DBMTRIMREGFB_v_1p106 << 12)                     /**< Shifted mode v_1p106 for RAC_PATRIM1        */
#define _RAC_PATRIM1_TX0DBMTRIMREGVREF_SHIFT                          16                                                               /**< Shift value for RAC_TX0DBMTRIMREGVREF       */
#define _RAC_PATRIM1_TX0DBMTRIMREGVREF_MASK                           0x70000UL                                                        /**< Bit mask for RAC_TX0DBMTRIMREGVREF          */
#define _RAC_PATRIM1_TX0DBMTRIMREGVREF_DEFAULT                        0x00000003UL                                                     /**< Mode DEFAULT for RAC_PATRIM1                */
#define _RAC_PATRIM1_TX0DBMTRIMREGVREF_v_1p572                        0x00000000UL                                                     /**< Mode v_1p572 for RAC_PATRIM1                */
#define _RAC_PATRIM1_TX0DBMTRIMREGVREF_v_1p593                        0x00000001UL                                                     /**< Mode v_1p593 for RAC_PATRIM1                */
#define _RAC_PATRIM1_TX0DBMTRIMREGVREF_v_1p613                        0x00000002UL                                                     /**< Mode v_1p613 for RAC_PATRIM1                */
#define _RAC_PATRIM1_TX0DBMTRIMREGVREF_v_default_1p634                0x00000003UL                                                     /**< Mode v_default_1p634 for RAC_PATRIM1        */
#define _RAC_PATRIM1_TX0DBMTRIMREGVREF_v_1p654                        0x00000004UL                                                     /**< Mode v_1p654 for RAC_PATRIM1                */
#define _RAC_PATRIM1_TX0DBMTRIMREGVREF_v_1p674                        0x00000005UL                                                     /**< Mode v_1p674 for RAC_PATRIM1                */
#define _RAC_PATRIM1_TX0DBMTRIMREGVREF_v_1p694                        0x00000006UL                                                     /**< Mode v_1p694 for RAC_PATRIM1                */
#define _RAC_PATRIM1_TX0DBMTRIMREGVREF_v_1p714                        0x00000007UL                                                     /**< Mode v_1p714 for RAC_PATRIM1                */
#define RAC_PATRIM1_TX0DBMTRIMREGVREF_DEFAULT                         (_RAC_PATRIM1_TX0DBMTRIMREGVREF_DEFAULT << 16)                   /**< Shifted mode DEFAULT for RAC_PATRIM1        */
#define RAC_PATRIM1_TX0DBMTRIMREGVREF_v_1p572                         (_RAC_PATRIM1_TX0DBMTRIMREGVREF_v_1p572 << 16)                   /**< Shifted mode v_1p572 for RAC_PATRIM1        */
#define RAC_PATRIM1_TX0DBMTRIMREGVREF_v_1p593                         (_RAC_PATRIM1_TX0DBMTRIMREGVREF_v_1p593 << 16)                   /**< Shifted mode v_1p593 for RAC_PATRIM1        */
#define RAC_PATRIM1_TX0DBMTRIMREGVREF_v_1p613                         (_RAC_PATRIM1_TX0DBMTRIMREGVREF_v_1p613 << 16)                   /**< Shifted mode v_1p613 for RAC_PATRIM1        */
#define RAC_PATRIM1_TX0DBMTRIMREGVREF_v_default_1p634                 (_RAC_PATRIM1_TX0DBMTRIMREGVREF_v_default_1p634 << 16)           /**< Shifted mode v_default_1p634 for RAC_PATRIM1*/
#define RAC_PATRIM1_TX0DBMTRIMREGVREF_v_1p654                         (_RAC_PATRIM1_TX0DBMTRIMREGVREF_v_1p654 << 16)                   /**< Shifted mode v_1p654 for RAC_PATRIM1        */
#define RAC_PATRIM1_TX0DBMTRIMREGVREF_v_1p674                         (_RAC_PATRIM1_TX0DBMTRIMREGVREF_v_1p674 << 16)                   /**< Shifted mode v_1p674 for RAC_PATRIM1        */
#define RAC_PATRIM1_TX0DBMTRIMREGVREF_v_1p694                         (_RAC_PATRIM1_TX0DBMTRIMREGVREF_v_1p694 << 16)                   /**< Shifted mode v_1p694 for RAC_PATRIM1        */
#define RAC_PATRIM1_TX0DBMTRIMREGVREF_v_1p714                         (_RAC_PATRIM1_TX0DBMTRIMREGVREF_v_1p714 << 16)                   /**< Shifted mode v_1p714 for RAC_PATRIM1        */
#define _RAC_PATRIM1_TX0DBMTRIMTAPCAP100F_SHIFT                       20                                                               /**< Shift value for RAC_TX0DBMTRIMTAPCAP100F    */
