SiliconLabs/gecko_sdk/platform/Device/SiliconLabs/EFR32BG24/Include/efr32bg24_rac.h
#define _RAC_PATRIM5_TXPATRIMPCASC_MASK                               0x300000UL                                           /**< Bit mask for RAC_TXPATRIMPCASC              */
#define _RAC_PATRIM5_TXPATRIMPCASC_DEFAULT                            0x00000001UL                                         /**< Mode DEFAULT for RAC_PATRIM5                */
#define _RAC_PATRIM5_TXPATRIMPCASC_pcbias_n50mv                       0x00000000UL                                         /**< Mode pcbias_n50mv for RAC_PATRIM5           */
#define _RAC_PATRIM5_TXPATRIMPCASC_pcbias_default                     0x00000001UL                                         /**< Mode pcbias_default for RAC_PATRIM5         */
#define _RAC_PATRIM5_TXPATRIMPCASC_pcbias_m50mv                       0x00000002UL                                         /**< Mode pcbias_m50mv for RAC_PATRIM5           */
#define _RAC_PATRIM5_TXPATRIMPCASC_pcbias_m100mv                      0x00000003UL                                         /**< Mode pcbias_m100mv for RAC_PATRIM5          */
#define RAC_PATRIM5_TXPATRIMPCASC_DEFAULT                             (_RAC_PATRIM5_TXPATRIMPCASC_DEFAULT << 20)           /**< Shifted mode DEFAULT for RAC_PATRIM5        */
#define RAC_PATRIM5_TXPATRIMPCASC_pcbias_n50mv                        (_RAC_PATRIM5_TXPATRIMPCASC_pcbias_n50mv << 20)      /**< Shifted mode pcbias_n50mv for RAC_PATRIM5   */
#define RAC_PATRIM5_TXPATRIMPCASC_pcbias_default                      (_RAC_PATRIM5_TXPATRIMPCASC_pcbias_default << 20)    /**< Shifted mode pcbias_default for RAC_PATRIM5 */
#define RAC_PATRIM5_TXPATRIMPCASC_pcbias_m50mv                        (_RAC_PATRIM5_TXPATRIMPCASC_pcbias_m50mv << 20)      /**< Shifted mode pcbias_m50mv for RAC_PATRIM5   */
#define RAC_PATRIM5_TXPATRIMPCASC_pcbias_m100mv                       (_RAC_PATRIM5_TXPATRIMPCASC_pcbias_m100mv << 20)     /**< Shifted mode pcbias_m100mv for RAC_PATRIM5  */
#define _RAC_PATRIM5_TXPATRIMREGSLICES_SHIFT                          24                                                   /**< Shift value for RAC_TXPATRIMREGSLICES       */
#define _RAC_PATRIM5_TXPATRIMREGSLICES_MASK                           0x3000000UL                                          /**< Bit mask for RAC_TXPATRIMREGSLICES          */
#define _RAC_PATRIM5_TXPATRIMREGSLICES_DEFAULT                        0x00000000UL                                         /**< Mode DEFAULT for RAC_PATRIM5                */
#define _RAC_PATRIM5_TXPATRIMREGSLICES_spare1                         0x00000000UL                                         /**< Mode spare1 for RAC_PATRIM5                 */
#define _RAC_PATRIM5_TXPATRIMREGSLICES_spare2                         0x00000001UL                                         /**< Mode spare2 for RAC_PATRIM5                 */
#define _RAC_PATRIM5_TXPATRIMREGSLICES_spare3                         0x00000002UL                                         /**< Mode spare3 for RAC_PATRIM5                 */
#define _RAC_PATRIM5_TXPATRIMREGSLICES_spare4                         0x00000003UL                                         /**< Mode spare4 for RAC_PATRIM5                 */
#define RAC_PATRIM5_TXPATRIMREGSLICES_DEFAULT                         (_RAC_PATRIM5_TXPATRIMREGSLICES_DEFAULT << 24)       /**< Shifted mode DEFAULT for RAC_PATRIM5        */
#define RAC_PATRIM5_TXPATRIMREGSLICES_spare1                          (_RAC_PATRIM5_TXPATRIMREGSLICES_spare1 << 24)        /**< Shifted mode spare1 for RAC_PATRIM5         */
#define RAC_PATRIM5_TXPATRIMREGSLICES_spare2                          (_RAC_PATRIM5_TXPATRIMREGSLICES_spare2 << 24)        /**< Shifted mode spare2 for RAC_PATRIM5         */
#define RAC_PATRIM5_TXPATRIMREGSLICES_spare3                          (_RAC_PATRIM5_TXPATRIMREGSLICES_spare3 << 24)        /**< Shifted mode spare3 for RAC_PATRIM5         */
#define RAC_PATRIM5_TXPATRIMREGSLICES_spare4                          (_RAC_PATRIM5_TXPATRIMREGSLICES_spare4 << 24)        /**< Shifted mode spare4 for RAC_PATRIM5         */

/* Bit fields for RAC TXPOWER */
#define _RAC_TXPOWER_RESETVALUE                                       0x00000010UL                                   /**< Default value for RAC_TXPOWER               */
#define _RAC_TXPOWER_MASK                                             0x0000003FUL                                   /**< Mask for RAC_TXPOWER                        */
#define _RAC_TXPOWER_TX0DBMPOWER_SHIFT                                0                                              /**< Shift value for RAC_TX0DBMPOWER             */
#define _RAC_TXPOWER_TX0DBMPOWER_MASK                                 0xFUL                                          /**< Bit mask for RAC_TX0DBMPOWER                */
#define _RAC_TXPOWER_TX0DBMPOWER_DEFAULT                              0x00000000UL                                   /**< Mode DEFAULT for RAC_TXPOWER                */
#define _RAC_TXPOWER_TX0DBMPOWER_on_stripe_0                          0x00000000UL                                   /**< Mode on_stripe_0 for RAC_TXPOWER            */
#define _RAC_TXPOWER_TX0DBMPOWER_on_stripe_15                         0x0000000FUL                                   /**< Mode on_stripe_15 for RAC_TXPOWER           */
#define RAC_TXPOWER_TX0DBMPOWER_DEFAULT                               (_RAC_TXPOWER_TX0DBMPOWER_DEFAULT << 0)        /**< Shifted mode DEFAULT for RAC_TXPOWER        */
#define RAC_TXPOWER_TX0DBMPOWER_on_stripe_0                           (_RAC_TXPOWER_TX0DBMPOWER_on_stripe_0 << 0)    /**< Shifted mode on_stripe_0 for RAC_TXPOWER    */
#define RAC_TXPOWER_TX0DBMPOWER_on_stripe_15                          (_RAC_TXPOWER_TX0DBMPOWER_on_stripe_15 << 0)   /**< Shifted mode on_stripe_15 for RAC_TXPOWER   */
#define _RAC_TXPOWER_TX0DBMSELSLICE_SHIFT                             4                                              /**< Shift value for RAC_TX0DBMSELSLICE          */
#define _RAC_TXPOWER_TX0DBMSELSLICE_MASK                              0x30UL                                         /**< Bit mask for RAC_TX0DBMSELSLICE             */
#define _RAC_TXPOWER_TX0DBMSELSLICE_DEFAULT                           0x00000001UL                                   /**< Mode DEFAULT for RAC_TXPOWER                */
#define _RAC_TXPOWER_TX0DBMSELSLICE_on_0_slice                        0x00000000UL                                   /**< Mode on_0_slice for RAC_TXPOWER             */
#define _RAC_TXPOWER_TX0DBMSELSLICE_on_1_slice                        0x00000001UL                                   /**< Mode on_1_slice for RAC_TXPOWER             */
#define _RAC_TXPOWER_TX0DBMSELSLICE_NA                                0x00000002UL                                   /**< Mode NA for RAC_TXPOWER                     */
#define _RAC_TXPOWER_TX0DBMSELSLICE_on_1_slices                       0x00000003UL                                   /**< Mode on_1_slices for RAC_TXPOWER            */
#define RAC_TXPOWER_TX0DBMSELSLICE_DEFAULT                            (_RAC_TXPOWER_TX0DBMSELSLICE_DEFAULT << 4)     /**< Shifted mode DEFAULT for RAC_TXPOWER        */
#define RAC_TXPOWER_TX0DBMSELSLICE_on_0_slice                         (_RAC_TXPOWER_TX0DBMSELSLICE_on_0_slice << 4)  /**< Shifted mode on_0_slice for RAC_TXPOWER     */
#define RAC_TXPOWER_TX0DBMSELSLICE_on_1_slice                         (_RAC_TXPOWER_TX0DBMSELSLICE_on_1_slice << 4)  /**< Shifted mode on_1_slice for RAC_TXPOWER     */
#define RAC_TXPOWER_TX0DBMSELSLICE_NA                                 (_RAC_TXPOWER_TX0DBMSELSLICE_NA << 4)          /**< Shifted mode NA for RAC_TXPOWER             */
#define RAC_TXPOWER_TX0DBMSELSLICE_on_1_slices                        (_RAC_TXPOWER_TX0DBMSELSLICE_on_1_slices << 4) /**< Shifted mode on_1_slices for RAC_TXPOWER    */

